Revit 2027 API
DimensionType.SetOrdinateDimensionSetting Method
 Sets the ordinate dimension settings for this DimensionType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetOrdinateDimensionSetting(
	OrdinateDimensionSetting ordinateDimSetting
)
Public Sub SetOrdinateDimensionSetting (
	ordinateDimSetting As OrdinateDimensionSetting
)
public:
void SetOrdinateDimensionSetting(
	OrdinateDimensionSetting^ ordinateDimSetting
)
member SetOrdinateDimensionSetting :
        ordinateDimSetting : OrdinateDimensionSetting -> unit
Parameters
ordinateDimSetting OrdinateDimensionSetting
 The new ordinate dimension settings.
Exceptions
Exception | Condition
ArgumentException |  The origin tick mark id in the Ordinate Dimension Setting is invalid for the dimension style.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This DimensionType cannot be assigned ordinate dimension settings, as it is not a linear DimensionType or its Dimension String Type parameter is not set to Ordinate.
See Also
Reference
DimensionType Class
Autodesk.Revit.DB Namespace